// Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).
// ПРосим у пользователя ввести число, затем возводим его в квадрат и выводим его значение.
Console.Write("Input number: ");
int number = Convert.ToInt32(Console.ReadLine());
int q = number * number;
Console.WriteLine(number + " -> " + q);

